In [2]:
# PANDAS LIBRARY INTRODUCTION 
# introduction to pandas library
# works of pandas is : 
#     Data Analysis and Data Manipulation,
#     Collect and Transform Data
#     Reshaping of Data Sets 
#     Time series-specific Functionality
#     Converting Other data structures into DataFrame

In [3]:
# SERIES STRUCTURE IN PANDAS LIBRARY
# Creating a Pandas Series with a List 
# the Pandas series; was created based on NumPy arrays 
# Pandas series keeps index information for each value as an extra.

In [4]:
import pandas as pd

In [14]:
pd.Series([10,20,30,40,50])

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [20]:
list_data=[2,4,6,8,10]
list_index=["a","b","c","d","e"]

In [29]:
variable=pd.Series(data=list_data,index=list_index,dtype="float16")

In [30]:
variable

a     2.0
b     4.0
c     6.0
d     8.0
e    10.0
dtype: float16

In [31]:
type(variable)

pandas.core.series.Series

In [39]:
list_data=[2,4,6,8,10,12]
list_index=["a","b","c","d","e"]

In [37]:
pd.Series(list_data,list_index)

ValueError: Length of values (5) does not match length of index (6)

In [40]:
# 2. Creating a Pandas Series with a Dictionary
import pandas as pd

In [43]:
dictionary={"ferrari":334.7,"porche":337.9,"lamborghini":349}

In [52]:
for carSpeed,speed in dictionary.items():
    print(carSpeed,speed)

ferrari 334.7
porche 337.9
lamborghini 349

In [45]:
pd.Series(data=dictionary)

ferrari        334.7
porche         337.9
lamborghini    349.0
dtype: float64

In [54]:
pd.Series(data=dictionary,index=["porche","bugatti","ferrari"])

porche     337.9
bugatti      NaN
ferrari    334.7
dtype: float64

In [56]:
# 3. Creating Pandas Series with NumPy Array
import numpy as np
import pandas as pd

In [58]:
example=np.array([1,3.3,5,7.2,9])
labels=np.array(["a","b","c","d","e"])

In [60]:
numpyArrVariable=pd.Series(data=example,index=labels)

In [61]:
numpyArrVariable

a    1.0
b    3.3
c    5.0
d    7.2
e    9.0
dtype: float64

In [62]:
# 4. Object types in Series 
import pandas as pd

In [64]:
example=pd.Series(["world",100,5.8,False])

In [65]:
example

0    world
1      100
2      5.8
3    False
dtype: object

In [70]:
print(type(example[0]))
print(type(example[1]))
print(type(example[2]))
print(type(example[3]))

<class 'str'>
<class 'int'>
<class 'float'>
<class 'bool'>

In [79]:
pd.Series([sum,type,max])

0    <built-in function sum>
1             <class 'type'>
2    <built-in function max>
dtype: object

In [80]:
# 5. Examining the Primary Features of the Pandas Seri
import pandas as pd

In [81]:
example=pd.Series([10,20,30,40,50,60,70])

In [82]:
example

0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

In [84]:
example.axes

[RangeIndex(start=0, stop=7, step=1)]

In [85]:
example.dtype

dtype('int64')

In [87]:
example.ndim

1

In [94]:
example.head(4) # head method return first five values by default

0    10
1    20
2    30
3    40
dtype: int64

In [96]:
example.tail(3)

4    50
5    60
6    70
dtype: int64

In [97]:
# 6. Most Applied Methods on Pandas Series
import pandas as pd

In [103]:
variable2=pd.Series([8,3,6,5,1],index=["a","b","c","d","e"])

In [104]:
variable2

a    8
b    3
c    6
d    5
e    1
dtype: int64

In [105]:
new_variable=variable2.sort_index()

In [106]:
new_variable

a    8
b    3
c    6
d    5
e    1
dtype: int64

In [112]:
new_variable2=variable2.sort_values()

In [113]:
new_variable2

e    1
b    3
d    5
c    6
a    8
dtype: int64

In [115]:
variable2.isin([6,1])

a    False
b    False
c     True
d    False
e     True
dtype: bool

In [116]:
variable2[variable2.isin([6,1])]

c    6
e    1
dtype: int64

In [119]:
variable2.values

array([8, 3, 6, 5, 1], dtype=int64)

In [120]:
variable2.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [122]:
[i for i in variable2.values]

[8, 3, 6, 5, 1]

In [123]:
variable2.items

<bound method Series.items of a    8
b    3
c    6
d    5
e    1
dtype: int64>

In [124]:
variable2.items()

In [125]:
list(variable2.items())

[('a', 8), ('b', 3), ('c', 6), ('d', 5), ('e', 1)]

In [130]:
for index,value in variable2.items():
    print(index, '-', value)

a - 8
b - 3
c - 6
d - 5
e - 1

In [131]:
# 7. Indexing and Slicing Pandas Series
import pandas as pd

In [132]:
example = pd.Series(["+90", "+49", "+33", "+39", "+46", "+47"], index = ["Turkey", "Germany", "France", "Italy", "Sweden", "Norway"])

In [133]:
example

Turkey     +90
Germany    +49
France     +33
Italy      +39
Sweden     +46
Norway     +47
dtype: object

In [135]:
example[2:6]

France    +33
Italy     +39
Sweden    +46
Norway    +47
dtype: object

In [137]:
example[0::2]

Turkey    +90
France    +33
Sweden    +46
dtype: object

In [138]:
example["Germany"]

'+49'

In [144]:
example["France":"Sweden"]

France    +33
Italy     +39
Sweden    +46
dtype: object

In [ ]:
# 9. DataFrame Structures in Pandas Library
# 1. Creating Pandas DataFrame with List 
# Pandas Dataframe is a multidimensional data structure

In [145]:
import pandas as pd

In [155]:
list_example=[5,10,15,20,25]

In [156]:
pd.DataFrame(data=list_example,columns=["values"],dtype="float")

   values
0     5.0
1    10.0
2    15.0
3    20.0
4    25.0

In [ ]:
# 2. Creating Pandas DataFrame with NumPy Array

In [158]:
import numpy as np
import pandas as pd

In [159]:
array_example=np.random.randint(0,50,(4,4))

In [160]:
array_example

array([[33, 22, 43, 32],
       [39, 28, 39, 31],
       [29, 17,  5, 41],
       [46,  3, 37,  7]])

In [164]:
df=pd.DataFrame(array_example,index=["row1","row2","row3","row4"],columns=["col1","col2","col3","col4"])

In [165]:
df

      col1  col2  col3  col4
row1    33    22    43    32
row2    39    28    39    31
row3    29    17     5    41
row4    46     3    37     7

In [166]:
# 3. Creating Pandas DataFrame with Dictionary 
import numpy as np
import pandas as pd

In [179]:
x=np.random.randint(10,50,size=6)
y=np.random.randint(10,50,size=6)
z=np.random.randint(10,50,size=6)
t=np.random.randint(10,50,size=6)

In [174]:
x

array([29, 12, 20, 44, 40, 34])

In [175]:
y

array([24, 35, 22, 30, 33, 39])

In [176]:
z

array([31, 49, 49, 27, 48, 42])

In [185]:
dict_example={"val1":x,"val2":y,"val3":z,"val4":t}

In [186]:
dict_example

{'val1': array([33, 43, 38, 15, 45, 10]),
 'val2': array([14, 26, 21, 15, 15, 25]),
 'val3': array([49, 28, 16, 12, 23, 17]),
 'val4': array([28, 45, 37, 36, 45, 15])}

In [187]:
df=pd.DataFrame(dict_example)

In [188]:
df

   val1  val2  val3  val4
0    33    14    49    28
1    43    26    28    45
2    38    21    16    37
3    15    15    12    36
4    45    15    23    45
5    10    25    17    15

In [7]:
# 4. Examining the Properties of Pandas DataFrames
import numpy as np
import pandas as pd
x1=np.random.randint(10,50,size=6)
y1=np.random.randint(10,50,size=6)
z1=np.random.randint(10,50,size=6)
t1=np.random.randint(10,50,size=6)

In [12]:
dict_example2={"val1":x1,"val2":y1,"val3":z1,"val4":t1}

In [14]:
df1=pd.DataFrame(dict_example2)

In [15]:
df1.head() # it gives df variable DataFrame first five values by default

   val1  val2  val3  val4
0    17    36    49    13
1    36    22    16    49
2    31    14    15    44
3    31    31    35    33
4    34    41    19    11

In [16]:
df1.head(3)

   val1  val2  val3  val4
0    17    36    49    13
1    36    22    16    49
2    31    14    15    44

In [17]:
df1.tail(3) # gives last three dataFrames rows

   val1  val2  val3  val4
3    31    31    35    33
4    34    41    19    11
5    32    20    29    43

In [18]:
df1.columns

Index(['val1', 'val2', 'val3', 'val4'], dtype='object')

In [19]:
[i for i in df1.columns]

['val1', 'val2', 'val3', 'val4']

In [20]:
df1.columns=["new1","new2","new3","new4"]

In [21]:
df1

   new1  new2  new3  new4
0    17    36    49    13
1    36    22    16    49
2    31    14    15    44
3    31    31    35    33
4    34    41    19    11
5    32    20    29    43

In [22]:
df1.values

array([[17, 36, 49, 13],
       [36, 22, 16, 49],
       [31, 14, 15, 44],
       [31, 31, 35, 33],
       [34, 41, 19, 11],
       [32, 20, 29, 43]])

In [23]:
type(df1.values)

numpy.ndarray

In [24]:
type(df1)

pandas.core.frame.DataFrame

In [25]:
df1.describe()

            new1       new2       new3       new4
count   6.000000   6.000000   6.000000   6.000000
mean   30.166667  27.333333  27.166667  32.166667
std     6.735478  10.347302  13.272779  16.473211
min    17.000000  14.000000  15.000000  11.000000
25%    31.000000  20.500000  16.750000  18.000000
50%    31.500000  26.500000  24.000000  38.000000
75%    33.500000  34.750000  33.500000  43.750000
max    36.000000  41.000000  49.000000  49.000000

In [26]:
df1.ndim

2

In [28]:
df1.size

24

In [29]:
# ELEMENT SELECTION OPERATIONS IN DATAFRAME STRUCTURES

In [1]:
# 1. Element Selection Operations in Pandas DataFrames Lesson 1 
import numpy as np
import pandas as pd

In [2]:
np.random.seed(101)
df=pd.DataFrame(data=np.random.randn(6,5),index="A B C D E F".split(),columns=["VAL1 VAL2 VAL3 VAL4 VAL5".split()])

In [3]:
df

       VAL1      VAL2      VAL3      VAL4      VAL5
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841
F  0.390528  0.166905  0.184502  0.807706  0.072960

In [10]:
df["VAL1"]

       VAL1
A  2.706850
B -0.319318
C  0.528813
D  0.955057
E  0.302665
F  0.390528

In [15]:
df["VAL1"][0:3]

       VAL1
A  2.706850
B -0.319318
C  0.528813

In [17]:
df[["VAL1"]][0:3]

       VAL1
A  2.706850
B -0.319318
C  0.528813

In [23]:
df[["VAL1","VAL2"]][0:3]

       VAL1      VAL2
A  2.706850  0.628133
B -0.319318 -0.848077
C  0.528813 -0.589001

In [28]:
df[["VAL1","VAL2"]]["B":"D"]

       VAL1      VAL2
B -0.319318 -0.848077
C  0.528813 -0.589001
D  0.955057  0.190794

In [7]:
df.VAL1

       VAL1
A  2.706850
B -0.319318
C  0.528813
D  0.955057
E  0.302665
F  0.390528

In [8]:
df.VAL3

       VAL3
A  0.907969
B  0.605965
C  0.188695
D  1.978757
E -1.706086
F  0.184502

In [9]:
df["VAL1"].values

array([[ 2.70684984],
       [-0.31931804],
       [ 0.52881349],
       [ 0.95505651],
       [ 0.30266545],
       [ 0.39052784]])

In [80]:
df[["VAL1"]]

       VAL1
A  2.706850
B -0.319318
C  0.528813
D  0.955057
E  0.302665
F  0.390528

In [81]:
df[["VAL1"]]["B":"D"]

       VAL1
B -0.319318
C  0.528813
D  0.955057

In [82]:
df[["VAL1"]][1:4]

       VAL1
B -0.319318
C  0.528813
D  0.955057

In [84]:
df["VAL1"][1:4]

       VAL1
B -0.319318
C  0.528813
D  0.955057

In [37]:
# 2. Element Selection Operations in Pandas DataFrames Lesson 2
import numpy as np
import pandas as pd

In [38]:
np.random.seed(101)
df=pd.DataFrame(data=np.random.randn(6,5),index="A B C D E F".split(),columns=["VAL1 VAL2 VAL3 VAL4 VAL5".split()])

In [39]:
df

       VAL1      VAL2      VAL3      VAL4      VAL5
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841
F  0.390528  0.166905  0.184502  0.807706  0.072960

In [40]:
df[["VAL2","VAL5"]]

       VAL2      VAL5
A  0.628133  0.651118
B -0.848077  0.740122
C -0.589001 -0.933237
D  0.190794  0.683509
E  1.693723 -0.134841
F  0.166905  0.072960

In [44]:
df[["VAL2","VAL2"]]

       VAL2      VAL2
A  0.628133  0.628133
B -0.848077 -0.848077
C -0.589001 -0.589001
D  0.190794  0.190794
E  1.693723  1.693723
F  0.166905  0.166905

In [45]:
df[["VAL2","VAL5"]]

       VAL2      VAL5
A  0.628133  0.651118
B -0.848077  0.740122
C -0.589001 -0.933237
D  0.190794  0.683509
E  1.693723 -0.134841
F  0.166905  0.072960

In [46]:
newSeries=df["VAL1"]

In [48]:
type(newSeries)

pandas.core.frame.DataFrame

In [49]:
newSeries2=df[["VAL1"]]

In [53]:
df

       VAL1      VAL2      VAL3      VAL4      VAL5
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841
F  0.390528  0.166905  0.184502  0.807706  0.072960

In [55]:
# How can we get dataframee on rows bases 
df["B":"D"]

       VAL1      VAL2      VAL3      VAL4      VAL5
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [56]:
df[1:4]

       VAL1      VAL2      VAL3      VAL4      VAL5
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [62]:
df["E":"E"]

       VAL1      VAL2      VAL3      VAL4      VAL5
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [68]:
df["E":"E"][["VAL2","VAL5"]]

       VAL2      VAL5
E  1.693723 -0.134841

In [77]:
# 3. Top Level Element Selection in Pandas DataFramesLesson 1
# Structure of loc and iloc 
import numpy as np
import pandas as pd

In [80]:
np.random.seed(101)
array=np.random.randint(10,50,(10,5))
df=pd.DataFrame(data=array,index="A B C D E F G H I J".split(),columns=["VAL1 VAL2 VAL3 VAL4 VAL5".split()])

In [81]:
array

array([[41, 21, 27, 16, 33],
       [21, 19, 23, 14, 38],
       [10, 15, 22, 39, 29],
       [18, 39, 44, 18, 29],
       [20, 22, 41, 33, 10],
       [19, 18, 46, 29, 45],
       [38, 17, 20, 49, 48],
       [19, 28, 17, 49, 25],
       [10, 22, 27, 21, 25],
       [43, 39, 34, 46, 29]])

In [82]:
df

  VAL1 VAL2 VAL3 VAL4 VAL5
A   41   21   27   16   33
B   21   19   23   14   38
C   10   15   22   39   29
D   18   39   44   18   29
E   20   22   41   33   10
F   19   18   46   29   45
G   38   17   20   49   48
H   19   28   17   49   25
I   10   22   27   21   25
J   43   39   34   46   29

In [87]:
# LOC : * it is used to select elements from the Data Frame
# * it allows as to operate with the index's name
# * And with in the loc method, the first and last elements are included in the slicing.

In [92]:
df.loc["A":"D"]

  VAL1 VAL2 VAL3 VAL4 VAL5
A   41   21   27   16   33
B   21   19   23   14   38
C   10   15   22   39   29
D   18   39   44   18   29

In [97]:
# ILOC method 
df.iloc[0,3]

16

In [119]:
df.iloc[0:4]

  VAL1 VAL2 VAL3 VAL4 VAL5
A   41   21   27   16   33
B   21   19   23   14   38
C   10   15   22   39   29
D   18   39   44   18   29

In [103]:
df

  VAL1 VAL2 VAL3 VAL4 VAL5
A   41   21   27   16   33
B   21   19   23   14   38
C   10   15   22   39   29
D   18   39   44   18   29
E   20   22   41   33   10
F   19   18   46   29   45
G   38   17   20   49   48
H   19   28   17   49   25
I   10   22   27   21   25
J   43   39   34   46   29

In [104]:
df.loc["C","VAL4"]

VAL4    39
Name: C, dtype: int32

In [108]:
# 4. Top Level Element Selection in Pandas DataFramesLesson 2
import numpy as np
import pandas as pd

In [109]:
np.random.seed(101)
array=np.random.randint(10,50,(10,5))
df=pd.DataFrame(data=array,index="A B C D E F G H I J".split(),columns=["VAL1 VAL2 VAL3 VAL4 VAL5".split()])

In [111]:
df

  VAL1 VAL2 VAL3 VAL4 VAL5
A   41   21   27   16   33
B   21   19   23   14   38
C   10   15   22   39   29
D   18   39   44   18   29
E   20   22   41   33   10
F   19   18   46   29   45
G   38   17   20   49   48
H   19   28   17   49   25
I   10   22   27   21   25
J   43   39   34   46   29

In [116]:
df[["VAL3"]]["C":"G"]

  VAL3
C   22
D   44
E   41
F   46
G   20

In [147]:
df.loc["C":"G","VAL3"]

  VAL3
C   22
D   44
E   41
F   46
G   20

In [149]:
df.loc["C":"G",["VAL3"]]

  VAL3
C   22
D   44
E   41
F   46
G   20

In [150]:
df.loc["C":"G"]

  VAL1 VAL2 VAL3 VAL4 VAL5
C   10   15   22   39   29
D   18   39   44   18   29
E   20   22   41   33   10
F   19   18   46   29   45
G   38   17   20   49   48

In [152]:
df.loc["C":"G"][["VAL3"]]

  VAL3
C   22
D   44
E   41
F   46
G   20

In [158]:
df.iloc[2:7,2]

C    22
D    44
E    41
F    46
G    20
Name: (VAL3,), dtype: int32

In [159]:
df.iloc[2:7,[2]]

  VAL3
C   22
D   44
E   41
F   46
G   20

In [160]:
df.iloc[2:7][["VAL3"]]

  VAL3
C   22
D   44
E   41
F   46
G   20

In [187]:
df.loc["C":"D"][['VAL2']]

  VAL2
C   15
D   39

In [164]:
# 5. Top Level Element Selection in Pandas DataFramesLesson 3
import numpy as np
import pandas as pd

In [165]:
np.random.seed(101)
array=np.random.randint(10,50,(10,5))
df=pd.DataFrame(data=array,index="A B C D E F G H I J".split(),columns=["VAL1 VAL2 VAL3 VAL4 VAL5".split()])

In [185]:
df.loc["C":"H","VAL1":"VAL5"]

  VAL1 VAL2 VAL3 VAL4 VAL5
C   10   15   22   39   29
D   18   39   44   18   29
E   20   22   41   33   10
F   19   18   46   29   45
G   38   17   20   49   48
H   19   28   17   49   25

In [195]:
df.iloc[2:8,1:4]

  VAL2 VAL3 VAL4
C   15   22   39
D   39   44   18
E   22   41   33
F   18   46   29
G   17   20   49
H   28   17   49

In [180]:
df[["VAL1","VAL2","VAL3","VAL4"]][2:7]

  VAL1 VAL2 VAL3 VAL4
C   10   15   22   39
D   18   39   44   18
E   20   22   41   33
F   19   18   46   29
G   38   17   20   49

In [182]:
df["VAL1"][0:3]

  VAL1
A   41
B   21
C   10

In [200]:
df.iloc[2:8,1:4].loc["E":"F",["VAL3"]]

  VAL3
E   41
F   46

In [233]:
# 6. Element Selection with Conditional Operations in
import numpy as np
import pandas as pd

In [236]:

array=np.random.randint(10,50,(10,5))
df=pd.DataFrame(data=array,index="A B C D E F G H I J".split(),columns=["VAL1 VAL2 VAL3 VAL4 VAL5".split()])

In [237]:
df

  VAL1 VAL2 VAL3 VAL4 VAL5
A   45   40   20   49   30
B   37   18   32   36   33
C   47   32   19   12   28
D   38   21   20   40   45
E   38   13   29   30   24
F   15   15   16   34   49
G   47   17   47   14   33
H   45   25   44   13   28
I   23   13   47   39   32
J   31   31   27   33   40

In [204]:
df>20

    VAL1   VAL2   VAL3   VAL4   VAL5
A   True   True   True  False   True
B   True  False   True  False   True
C  False  False   True   True   True
D  False   True   True  False   True
E  False   True   True   True  False
F  False  False   True   True   True
G   True  False  False   True   True
H  False   True  False   True   True
I  False   True   True   True   True
J   True   True   True   True   True

In [205]:
df == ""

    VAL1   VAL2   VAL3   VAL4   VAL5
A  False  False  False  False  False
B  False  False  False  False  False
C  False  False  False  False  False
D  False  False  False  False  False
E  False  False  False  False  False
F  False  False  False  False  False
G  False  False  False  False  False
H  False  False  False  False  False
I  False  False  False  False  False
J  False  False  False  False  False

In [221]:
df == None

    VAL1   VAL2   VAL3   VAL4   VAL5
A  False  False  False  False  False
B  False  False  False  False  False
C  False  False  False  False  False
D  False  False  False  False  False
E  False  False  False  False  False
F  False  False  False  False  False
G  False  False  False  False  False
H  False  False  False  False  False
I  False  False  False  False  False
J  False  False  False  False  False

In [222]:
df >20

    VAL1   VAL2   VAL3   VAL4   VAL5
A   True   True   True  False   True
B   True  False   True  False   True
C  False  False   True   True   True
D  False   True   True  False   True
E  False   True   True   True  False
F  False  False   True   True   True
G   True  False  False   True   True
H  False   True  False   True   True
I  False   True   True   True   True
J   True   True   True   True   True

In [225]:
df[df >20]

   VAL1  VAL2  VAL3  VAL4  VAL5
A  41.0  21.0  27.0   NaN  33.0
B  21.0   NaN  23.0   NaN  38.0
C   NaN   NaN  22.0  39.0  29.0
D   NaN  39.0  44.0   NaN  29.0
E   NaN  22.0  41.0  33.0   NaN
F   NaN   NaN  46.0  29.0  45.0
G  38.0   NaN   NaN  49.0  48.0
H   NaN  28.0   NaN  49.0  25.0
I   NaN  22.0  27.0  21.0  25.0
J  43.0  39.0  34.0  46.0  29.0

In [226]:
df["VAL1"]<20

    VAL1
A  False
B  False
C   True
D   True
E  False
F   True
G  False
H   True
I   True
J  False

In [230]:
df[df["VAL1"]<20]

   VAL1 VAL2 VAL3 VAL4 VAL5
A   NaN  NaN  NaN  NaN  NaN
B   NaN  NaN  NaN  NaN  NaN
C  10.0  NaN  NaN  NaN  NaN
D  18.0  NaN  NaN  NaN  NaN
E   NaN  NaN  NaN  NaN  NaN
F  19.0  NaN  NaN  NaN  NaN
G   NaN  NaN  NaN  NaN  NaN
H  19.0  NaN  NaN  NaN  NaN
I  10.0  NaN  NaN  NaN  NaN
J   NaN  NaN  NaN  NaN  NaN

In [232]:
df[df["VAL1"]<20][["VAL2"]]

  VAL2
A  NaN
B  NaN
C  NaN
D  NaN
E  NaN
F  NaN
G  NaN
H  NaN
I  NaN
J  NaN

In [3]:
# 11. STRUCTURAL OPERATIONS ON PANDAS DATAFRAME
# 1. Adding Columns to Pandas Data Frames
import pandas as pd
import numpy as np

In [8]:
x=np.arange(0,28).reshape(7,4)
df=pd.DataFrame(data=x,columns='VAL1 VAL2 VAL3 VAL4'.split())

In [23]:
df

   VAL1  VAL2  VAL3  VAL4  VAL5  VAL6
0     0     1     2     3     1     5
1     4     5     6     7     9    13
2     8     9    10    11    17    21
3    12    13    14    15    25    29
4    16    17    18    19    33    37
5    20    21    22    23    41    45
6    24    25    26    27    49    53

In [24]:
df["VAL1"]+df["VAL2"]

0     1
1     9
2    17
3    25
4    33
5    41
6    49
dtype: int32

In [16]:
df["VAL5"]=df["VAL1"]+df["VAL2"]

In [17]:
df

   VAL1  VAL2  VAL3  VAL4  VAL5
0     0     1     2     3     1
1     4     5     6     7     9
2     8     9    10    11    17
3    12    13    14    15    25
4    16    17    18    19    33
5    20    21    22    23    41
6    24    25    26    27    49

In [33]:
df["VAL6"]=df["VAL3"] * df["VAL4"]

In [34]:
df

   VAL1  VAL2  VAL3  VAL4  VAL5  VAL6
0     0     1     2     3     1     6
1     4     5     6     7     9    42
2     8     9    10    11    17   110
3    12    13    14    15    25   210
4    16    17    18    19    33   342
5    20    21    22    23    41   506
6    24    25    26    27    49   702

In [43]:
df["VAL7"]=np.arange(28,35)

In [44]:
df

   VAL1  VAL2  VAL3  VAL4  VAL5  VAL6  VAL7 VAL8
0     0     1     2     3     1     6    28   35
1     4     5     6     7     9    42    29   36
2     8     9    10    11    17   110    30   37
3    12    13    14    15    25   210    31   38
4    16    17    18    19    33   342    32   39
5    20    21    22    23    41   506    33   40
6    24    25    26    27    49   702    34

In [45]:
df["VAL8"]=[35,36,37,38,39,40,41]

In [46]:
df

   VAL1  VAL2  VAL3  VAL4  VAL5  VAL6  VAL7  VAL8
0     0     1     2     3     1     6    28    35
1     4     5     6     7     9    42    29    36
2     8     9    10    11    17   110    30    37
3    12    13    14    15    25   210    31    38
4    16    17    18    19    33   342    32    39
5    20    21    22    23    41   506    33    40
6    24    25    26    27    49   702    34    41

In [42]:
df

   VAL1  VAL2  VAL3  VAL4  VAL5  VAL6  VAL7 VAL8
0     0     1     2     3     1     6    28   35
1     4     5     6     7     9    42    29   36
2     8     9    10    11    17   110    30   37
3    12    13    14    15    25   210    31   38
4    16    17    18    19    33   342    32   39
5    20    21    22    23    41   506    33   40
6    24    25    26    27    49   702    34

In [49]:
# 2. Removing Rows and Columns from Pandas Data frames
import numpy as np
import pandas as pd

In [65]:
x=np.arange(0,28).reshape(7,4)
df=pd.DataFrame(data=x,columns=["VAL1","VAL2","VAL3","VAL4"])

In [66]:
df

   VAL1  VAL2  VAL3  VAL4
0     0     1     2     3
1     4     5     6     7
2     8     9    10    11
3    12    13    14    15
4    16    17    18    19
5    20    21    22    23
6    24    25    26    27

In [67]:
# removing columns 
df.drop(["VAL3","VAL4"],axis=1,inplace=False )

   VAL1  VAL2
0     0     1
1     4     5
2     8     9
3    12    13
4    16    17
5    20    21
6    24    25

In [68]:
df

   VAL1  VAL2  VAL3  VAL4
0     0     1     2     3
1     4     5     6     7
2     8     9    10    11
3    12    13    14    15
4    16    17    18    19
5    20    21    22    23
6    24    25    26    27

In [69]:
# removing rows 
df.drop([2,5],axis=0,inplace=True)

In [70]:
df

   VAL1  VAL2  VAL3  VAL4
0     0     1     2     3
1     4     5     6     7
3    12    13    14    15
4    16    17    18    19
6    24    25    26    27

In [101]:
# 3. Null Values in Pandas Dataframes
import numpy as np
import pandas as pd

In [102]:
df=pd.DataFrame({'VAL1':[2,4,np.nan,6,np.nan,8,10],
                'VAL2':[123,np.nan,456,np.nan,789,246,357],
                'VAL3':['France','Greece','USA','Japan',"Sweden","Norway","Turkey"]})

In [103]:
df

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [117]:
df.isnull()

    VAL1   VAL2   VAL3
0  False  False  False
1  False   True  False
2   True  False  False
3  False   True  False
4   True  False  False
5  False  False  False
6  False  False  False

In [118]:
df

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [119]:
df.isnull().sum()

VAL1    2
VAL2    2
VAL3    0
dtype: int64

In [121]:
len(df)

7

In [122]:
df.isnull().sum() /len(df)*100

VAL1    28.571429
VAL2    28.571429
VAL3     0.000000
dtype: float64

In [123]:
df

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [125]:
df.notnull()

    VAL1   VAL2  VAL3
0   True   True  True
1   True  False  True
2  False   True  True
3   True  False  True
4  False   True  True
5   True   True  True
6   True   True  True

In [136]:
df.notnull().sum().sum()

17

In [137]:
df

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [135]:
df["VAL1"].notnull()

0     True
1     True
2    False
3     True
4    False
5     True
6     True
Name: VAL1, dtype: bool

In [134]:
df[df["VAL1"].notnull()]

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0    NaN  Greece
3   6.0    NaN   Japan
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [142]:
df.isnull().any()

VAL1     True
VAL2     True
VAL3    False
dtype: bool

In [153]:
df

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [140]:
df.isnull().any(axis=1)

0    False
1     True
2     True
3     True
4     True
5    False
6    False
dtype: bool

In [143]:
condition=df.isnull().any(axis=1)

In [145]:
df[condition]

   VAL1   VAL2    VAL3
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden

In [154]:
df[~condition]

   VAL1   VAL2    VAL3
0   2.0  123.0  France
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [158]:
df2=df

In [150]:
df.notnull().all()

VAL1    False
VAL2    False
VAL3     True
dtype: bool

In [157]:
df.notnull().any()

VAL1    True
VAL2    True
VAL3    True
dtype: bool

In [162]:
df=df2

In [165]:
df2["VAL1"]=[1,2,3,4,5,6,7]

In [166]:
df2

   VAL1   VAL2    VAL3
0     1  123.0  France
1     2    NaN  Greece
2     3  456.0     USA
3     4    NaN   Japan
4     5  789.0  Sweden
5     6  246.0  Norway
6     7  357.0  Turkey

In [167]:
df2.notnull().any()

VAL1    True
VAL2    True
VAL3    True
dtype: bool

In [168]:
df2.notnull().all()

VAL1     True
VAL2    False
VAL3     True
dtype: bool

In [170]:
df2.notnull().all(axis=1)

0     True
1    False
2     True
3    False
4     True
5     True
6     True
dtype: bool

In [171]:
# 4. Dropping Null Values Dropna() Function
import numpy as np
import pandas as pd

In [202]:
df=pd.DataFrame({'VAL1':[2,4,np.nan,6,np.nan,8,10],
                'VAL2':[123,np.nan,456,np.nan,789,246,357],
                'VAL3':['France','Greece','USA','Japan',"Sweden","Norway","Turkey"]})

In [203]:
 df

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [204]:
df.dropna() #it drops that row who has empty value

   VAL1   VAL2    VAL3
0   2.0  123.0  France
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [205]:
df.dropna(axis=1)

     VAL3
0  France
1  Greece
2     USA
3   Japan
4  Sweden
5  Norway
6  Turkey

In [206]:
df["VAL4"]=np.nan

In [207]:
df

   VAL1   VAL2    VAL3  VAL4
0   2.0  123.0  France   NaN
1   4.0    NaN  Greece   NaN
2   NaN  456.0     USA   NaN
3   6.0    NaN   Japan   NaN
4   NaN  789.0  Sweden   NaN
5   8.0  246.0  Norway   NaN
6  10.0  357.0  Turkey   NaN

In [208]:
df.dropna(how="all")

   VAL1   VAL2    VAL3  VAL4
0   2.0  123.0  France   NaN
1   4.0    NaN  Greece   NaN
2   NaN  456.0     USA   NaN
3   6.0    NaN   Japan   NaN
4   NaN  789.0  Sweden   NaN
5   8.0  246.0  Norway   NaN
6  10.0  357.0  Turkey   NaN

In [211]:
df.dropna(how="all",axis=1)

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [215]:
# permanent change in dataframe using dropna method 
df.dropna(how="all",axis=1,inplace=True)
df

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [178]:
dfNew=df

In [181]:
dfNew["VAL1"]=np.arange(0,7)

In [184]:
dfNew.dropna(axis=1)

   VAL1    VAL3
0     0  France
1     1  Greece
2     2     USA
3     3   Japan
4     4  Sweden
5     5  Norway
6     6  Turkey

In [216]:
dfNew.dropna(axis=1,how='any')

   VAL1    VAL3
0     0  France
1     1  Greece
2     2     USA
3     3   Japan
4     4  Sweden
5     5  Norway
6     6  Turkey

In [219]:
dfNew

   VAL1   VAL2    VAL3  VAL4
0     0  123.0  France   NaN
1     1    NaN  Greece   NaN
2     2  456.0     USA   NaN
3     3    NaN   Japan   NaN
4     4  789.0  Sweden   NaN
5     5  246.0  Norway   NaN
6     6  357.0  Turkey   NaN

In [227]:
dfNew.index=['one','two','three','four','five','six','seven']
dfNew.columns=['val1','val2','val3','val4']
dfNew

       val1   val2    val3  val4
one       0  123.0  France   NaN
two       1    NaN  Greece   NaN
three     2  456.0     USA   NaN
four      3    NaN   Japan   NaN
five      4  789.0  Sweden   NaN
six       5  246.0  Norway   NaN
seven     6  357.0  Turkey   NaN

In [228]:
# 5. Filling Null Values Fillna() Function
import numpy as np
import pandas as pd

In [229]:
df=pd.DataFrame({'VAL1':[2,4,np.nan,6,np.nan,8,10],
                'VAL2':[123,np.nan,456,np.nan,789,246,357],
                'VAL3':['France','Greece','USA','Japan',"Sweden","Norway","Turkey"]})

In [241]:
df

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [243]:
df.fillna(100000)

       VAL1      VAL2    VAL3
0       2.0     123.0  France
1       4.0  100000.0  Greece
2  100000.0     456.0     USA
3       6.0  100000.0   Japan
4  100000.0     789.0  Sweden
5       8.0     246.0  Norway
6      10.0     357.0  Turkey

In [244]:
df

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [245]:
df["VAL1"].fillna('Shahid is')

0          2.0
1          4.0
2    Shahid is
3          6.0
4    Shahid is
5          8.0
6         10.0
Name: VAL1, dtype: object

In [252]:
# averages of dataframe columns 
df.mean(numeric_only=True) # Here Numeric only means it calculates mean only the numeric_only=True

VAL1      6.0
VAL2    394.2
dtype: float64

In [251]:
# it fills the average of column to nan 
df.fillna(df.mean(numeric_only=True))

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0  394.2  Greece
2   6.0  456.0     USA
3   6.0  394.2   Japan
4   6.0  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [253]:
# it fills all columns specified values 

df.fillna({"VAL1":100000,"VAL2":200000})

       VAL1      VAL2    VAL3
0       2.0     123.0  France
1       4.0  200000.0  Greece
2  100000.0     456.0     USA
3       6.0  200000.0   Japan
4  100000.0     789.0  Sweden
5       8.0     246.0  Norway
6      10.0     357.0  Turkey

In [258]:
df["VAL1"].fillna(df["VAL2"].mean(numeric_only=True))

0      2.0
1      4.0
2    394.2
3      6.0
4    394.2
5      8.0
6     10.0
Name: VAL1, dtype: float64

In [259]:
df["VAL3"][0::2]

0    France
2       USA
4    Sweden
6    Turkey
Name: VAL3, dtype: object

In [260]:
df["VAL3"][0::2]=np.nan

C:\Users\Shahid\AppData\Local\Temp\ipykernel_7624\1822149598.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["VAL3"][0::2]=np.nan

In [262]:
df

   VAL1   VAL2    VAL3
0   2.0  123.0     NaN
1   4.0    NaN  Greece
2   NaN  456.0     NaN
3   6.0    NaN   Japan
4   NaN  789.0     NaN
5   8.0  246.0  Norway
6  10.0  357.0     NaN

In [263]:
df["VAL3"].fillna("Turkey")

0    Turkey
1    Greece
2    Turkey
3     Japan
4    Turkey
5    Norway
6    Turkey
Name: VAL3, dtype: object

In [238]:
df.fillna(value='Shahid') #fillna method fill the passed parameter values

     VAL1    VAL2    VAL3
0     2.0   123.0  France
1     4.0  Shahid  Greece
2  Shahid   456.0     USA
3     6.0  Shahid   Japan
4  Shahid   789.0  Sweden
5     8.0   246.0  Norway
6    10.0   357.0  Turkey

In [272]:
df.fillna(method='backfill')

   VAL1   VAL2    VAL3
0   2.0  123.0  Greece
1   4.0  456.0  Greece
2   6.0  456.0   Japan
3   6.0  789.0   Japan
4   8.0  789.0  Norway
5   8.0  246.0  Norway
6  10.0  357.0     NaN

In [270]:
df

   VAL1   VAL2    VAL3
0   2.0  123.0     NaN
1   4.0    NaN  Greece
2   NaN  456.0     NaN
3   6.0    NaN   Japan
4   NaN  789.0     NaN
5   8.0  246.0  Norway
6  10.0  357.0     NaN

In [271]:
df.fillna(method='bfill') # insert next value

   VAL1   VAL2    VAL3
0   2.0  123.0  Greece
1   4.0  456.0  Greece
2   6.0  456.0   Japan
3   6.0  789.0   Japan
4   8.0  789.0  Norway
5   8.0  246.0  Norway
6  10.0  357.0     NaN

In [264]:
df.fillna(method='ffill')

   VAL1   VAL2    VAL3
0   2.0  123.0     NaN
1   4.0  123.0  Greece
2   4.0  456.0  Greece
3   6.0  456.0   Japan
4   6.0  789.0   Japan
5   8.0  246.0  Norway
6  10.0  357.0  Norway

In [267]:
df.fillna(method='bfill')

   VAL1   VAL2    VAL3
0   2.0  123.0  Greece
1   4.0  456.0  Greece
2   6.0  456.0   Japan
3   6.0  789.0   Japan
4   8.0  789.0  Norway
5   8.0  246.0  Norway
6  10.0  357.0     NaN

In [268]:
df.fillna(method='pad')

   VAL1   VAL2    VAL3
0   2.0  123.0     NaN
1   4.0  123.0  Greece
2   4.0  456.0  Greece
3   6.0  456.0   Japan
4   6.0  789.0   Japan
5   8.0  246.0  Norway
6  10.0  357.0  Norway

In [273]:
df.fillna(method='bfill')

   VAL1   VAL2    VAL3
0   2.0  123.0  Greece
1   4.0  456.0  Greece
2   6.0  456.0   Japan
3   6.0  789.0   Japan
4   8.0  789.0  Norway
5   8.0  246.0  Norway
6  10.0  357.0     NaN

In [1]:
# 6. Setting Index in Pandas DataFrames
import numpy as np
import pandas as pd

In [2]:
np.random.seed(101)
df=pd.DataFrame(data=np.random.randn(6,5),index="A B C D E F".split(),columns="VAL1 VAL2 VAL3 VAL4 VAL5".split())

In [3]:
df

       VAL1      VAL2      VAL3      VAL4      VAL5
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841
F  0.390528  0.166905  0.184502  0.807706  0.072960

In [4]:
df.reset_index()

  index      VAL1      VAL2      VAL3      VAL4      VAL5
0     A  2.706850  0.628133  0.907969  0.503826  0.651118
1     B -0.319318 -0.848077  0.605965 -2.018168  0.740122
2     C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
3     D  0.955057  0.190794  1.978757  2.605967  0.683509
4     E  0.302665  1.693723 -1.706086 -1.159119 -0.134841
5     F  0.390528  0.166905  0.184502  0.807706  0.072960

In [6]:
df.reset_index(drop=True,inplace=True)

In [7]:
df

       VAL1      VAL2      VAL3      VAL4      VAL5
0  2.706850  0.628133  0.907969  0.503826  0.651118
1 -0.319318 -0.848077  0.605965 -2.018168  0.740122
2  0.528813 -0.589001  0.188695 -0.758872 -0.933237
3  0.955057  0.190794  1.978757  2.605967  0.683509
4  0.302665  1.693723 -1.706086 -1.159119 -0.134841
5  0.390528  0.166905  0.184502  0.807706  0.072960

In [8]:
example="TR F NL RUS AUS AZ".split()

In [11]:
df["new_index"]=example

In [12]:
df

       VAL1      VAL2      VAL3      VAL4      VAL5 new_index
0  2.706850  0.628133  0.907969  0.503826  0.651118        TR
1 -0.319318 -0.848077  0.605965 -2.018168  0.740122         F
2  0.528813 -0.589001  0.188695 -0.758872 -0.933237        NL
3  0.955057  0.190794  1.978757  2.605967  0.683509       RUS
4  0.302665  1.693723 -1.706086 -1.159119 -0.134841       AUS
5  0.390528  0.166905  0.184502  0.807706  0.072960        AZ

In [13]:
df.set_index("new_index")

               VAL1      VAL2      VAL3      VAL4      VAL5
new_index
TR         2.706850  0.628133  0.907969  0.503826  0.651118
F         -0.319318 -0.848077  0.605965 -2.018168  0.740122
NL         0.528813 -0.589001  0.188695 -0.758872 -0.933237
RUS        0.955057  0.190794  1.978757  2.605967  0.683509
AUS        0.302665  1.693723 -1.706086 -1.159119 -0.134841
AZ         0.390528  0.166905  0.184502  0.807706  0.072960

In [14]:
df.set_index("new_index",inplace=True)

In [15]:
df

               VAL1      VAL2      VAL3      VAL4      VAL5
new_index
TR         2.706850  0.628133  0.907969  0.503826  0.651118
F         -0.319318 -0.848077  0.605965 -2.018168  0.740122
NL         0.528813 -0.589001  0.188695 -0.758872 -0.933237
RUS        0.955057  0.190794  1.978757  2.605967  0.683509
AUS        0.302665  1.693723 -1.706086 -1.159119 -0.134841
AZ         0.390528  0.166905  0.184502  0.807706  0.072960

In [18]:
# 12. MULTI-INDEXED DATAFRAME STRUCTURES
# 1. Multi-Index and Index Hierarchy in Pandas DataFrames
import numpy as np
import pandas as pd

In [43]:
inside=["class A","class B","class C","class A","class B","class C"]
outside=["school 1","school 1","school 1","school 2","school 2","school 2"]
zip(outside,inside)
multi_index=list(list(zip(outside,inside)))
hier_index=pd.MultiIndex.from_tuples(multi_index)
hier_index
np.random.seed(101)
df=pd.DataFrame(data=np.random.randint(70,100,size=(6,2)),index=hier_index,columns=["1st_semester","2st_semester"])

In [44]:
df

                  1st_semester  2st_semester
school 1 class A            81            87
         class B            76            93
         class C            99            81
school 2 class A            85            79
         class B            83            78
         class C            74            78

In [45]:
df.loc['school 1']['1st_semester']

class A    81
class B    76
class C    99
Name: 1st_semester, dtype: int32

In [3]:
# 2. Element Selection in Multi-Indexed DataFrames
import numpy as np
import pandas as pd

In [7]:
inside=["class A","class B","class C","class A","class B","class C"]
outside=["school1","school1","school1","school2","school2","school2"]
zip(outside,inside)
multi_index=list(list(zip(outside,inside)))
hier_index=pd.MultiIndex.from_tuples(multi_index)
hier_index
np.random.seed(101)
df=pd.DataFrame(data=np.random.randint(70,100,size=(6,2)),index=hier_index,columns=["1st_semester","2st_semester"])

In [5]:
multi_index

[('school1', 'class A'),
 ('school1', 'class B'),
 ('school1', 'class C'),
 ('school2', 'class A'),
 ('school2', 'class B'),
 ('school2', 'class C')]

In [56]:
df[["1st_semester"]]

                 1st_semester
school1 class A            81
        class B            76
        class C            99
school2 class A            85
        class B            83
        class C            74

In [57]:
df[["2st_semester"]]

                 2st_semester
school1 class A            87
        class B            93
        class C            81
school2 class A            79
        class B            78
        class C            78

In [58]:
df

                 1st_semester  2st_semester
school1 class A            81            87
        class B            76            93
        class C            99            81
school2 class A            85            79
        class B            83            78
        class C            74            78

In [64]:
df.loc["school1"].loc[["class B"]]

         1st_semester  2st_semester
class B            76            93

In [69]:
df.index.names=["schools","classes"]

In [70]:
df

                 1st_semester  2st_semester
schools classes
school1 class A            81            87
        class B            76            93
        class C            99            81
school2 class A            85            79
        class B            83            78
        class C            74            78

In [71]:
# 3. Selecting Elements using the xs() Function in Multi-indexed DataFrames 
import numpy as np
import pandas as pd

In [8]:
inside=["class A","class B","class C","class A","class B","class C"]
outside=["school1","school1","school1","school2","school2","school2"]
zip(outside,inside)
multi_index=list(list(zip(outside,inside)))
hier_index=pd.MultiIndex.from_tuples(multi_index)
hier_index
np.random.seed(101)
df=pd.DataFrame(data=np.random.randint(70,100,size=(6,2)),index=hier_index,columns=["1st_semester","2st_semester"])

df.index.names=["schools","classes"]

In [9]:
df

                 1st_semester  2st_semester
schools classes
school1 class A            81            87
        class B            76            93
        class C            99            81
school2 class A            85            79
        class B            83            78
        class C            74            78

In [10]:
df.xs("school1") #.xs() method is used to select data at a particular level and axis of a multi-index DataFrame or Series.

         1st_semester  2st_semester
classes
class A            81            87
class B            76            93
class C            99            81

In [79]:
df.xs(("school2","class A"))

1st_semester    85
2st_semester    79
Name: (school2, class A), dtype: int32

In [81]:
df.xs(("school2","class A"),level=[0,1])

                 1st_semester  2st_semester
schools classes
school2 class A            85            79

In [82]:
df.xs("class A",level='classes')

         1st_semester  2st_semester
schools
school1            81            87
school2            85            79

In [1]:
df.xs("class A",level=1)

NameError: name 'df' is not defined

In [4]:
# 13. STRUCTURAL CONCATENATION OPERATIONS IN PANDAS DATAFRAME
# 1. Concatenating Pandas Dataframes Concat Function
import numpy as np
import pandas as pd

df1=pd.DataFrame({'X':['X0','X1','X2','X3'],
                 'Y':['Y0','Y1','Y2','Y3'],
                  'Z':['Z0','Z1','Z2','Z3'],
                  'T':['T0','T1','T2','T3']})

df2=pd.DataFrame({'X':['X4','X5','X6','X7'],
                 'Y':['Y4','Y5','Y6','Y7'],
                  'Z':['Z4','Z5','Z6','Z7'],
                  'T':['T4','T5','T6','T7']})

df3=pd.DataFrame({'X':['X8','X9','X10','X11'],
                 'Y':['Y8','Y9','Y10','Y11'],
                  'Z':['Z8','Z9','Z10','Z11'],
                  'T':['T8','T9','T10','T11']})

In [18]:
df1

    X   Y   Z   T
0  X0  Y0  Z0  T0
1  X1  Y1  Z1  T1
2  X2  Y2  Z2  T2
3  X3  Y3  Z3  T3

In [19]:
df2

    X   Y   Z   T
0  X4  Y4  Z4  T4
1  X5  Y5  Z5  T5
2  X6  Y6  Z6  T6
3  X7  Y7  Z7  T7

In [20]:
df3

     X    Y    Z    T
0   X8   Y8   Z8   T8
1   X9   Y9   Z9   T9
2  X10  Y10  Z10  T10
3  X11  Y11  Z11  T11

In [5]:
# Concat function:- it is used to concat more than one data Frame 
# all parameters are: ignore_index,join,axis
# ignore_index--> it ignores already indexes and make custom indexes 
# join---> it gives the union or intersection dataframes depends on the options('inner' or "outer")
pd.concat([df1,df2,df3],ignore_index=True,join="inner" )

      X    Y    Z    T
0    X0   Y0   Z0   T0
1    X1   Y1   Z1   T1
2    X2   Y2   Z2   T2
3    X3   Y3   Z3   T3
4    X4   Y4   Z4   T4
5    X5   Y5   Z5   T5
6    X6   Y6   Z6   T6
7    X7   Y7   Z7   T7
8    X8   Y8   Z8   T8
9    X9   Y9   Z9   T9
10  X10  Y10  Z10  T10
11  X11  Y11  Z11  T11

In [6]:
# index--->1 or 0 changes the concatention should be from x axis or y axis
pd.concat([df1,df2,df3],axis=1 )

    X   Y   Z   T   X   Y   Z   T    X    Y    Z    T
0  X0  Y0  Z0  T0  X4  Y4  Z4  T4   X8   Y8   Z8   T8
1  X1  Y1  Z1  T1  X5  Y5  Z5  T5   X9   Y9   Z9   T9
2  X2  Y2  Z2  T2  X6  Y6  Z6  T6  X10  Y10  Z10  T10
3  X3  Y3  Z3  T3  X7  Y7  Z7  T7  X11  Y11  Z11  T11

In [7]:

df1=pd.DataFrame({'X':['X0','X1','X2','X3'],
                 'Y':['Y0','Y1','Y2','Y3'],
                  'Z':['Z0','Z1','Z2','Z3'],
                  'T':['T0','T1','T2','T3']},index=[1,2,3,4])

df2=pd.DataFrame({'X':['X4','X5','X6','X7'],
                 'Y':['Y4','Y5','Y6','Y7'],
                  'Z':['Z4','Z5','Z6','Z7'],
                  'T':['T4','T5','T6','T7']},index=[5,6,7,8])

df3=pd.DataFrame({'X':['X8','X9','X10','X11'],
                 'Y':['Y8','Y9','Y10','Y11'],
                  'Z':['Z8','Z9','Z10','Z11'],
                  'T':['T8','T9','T10','T11']},index=[9,10,11,12])

In [8]:
pd.concat([df1,df2,df3],axis=1)

      X    Y    Z    T    X    Y    Z    T    X    Y    Z    T
1    X0   Y0   Z0   T0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    X1   Y1   Z1   T1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    X2   Y2   Z2   T2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4    X3   Y3   Z3   T3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   X4   Y4   Z4   T4  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   X5   Y5   Z5   T5  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   X6   Y6   Z6   T6  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN   X7   Y7   Z7   T7  NaN  NaN  NaN  NaN
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   X8   Y8   Z8   T8
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   X9   Y9   Z9   T9
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  X10  Y10  Z10  T10
12  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  X11  Y11  Z11  T11

In [10]:
# now we can test join==inner ==> it gives common between all data frames 
#it does not gives anything because no anything is common like in previous cell we can see
pd.concat([df1,df2,df3],axis=1,join='inner')

Empty DataFrame
Columns: [X, Y, Z, T, X, Y, Z, T, X, Y, Z, T]
Index: []

In [17]:
# '2. Merge Pandas Dataframes Merge() Function Lesson 1
import numpy as np
import pandas as pd

In [23]:
df1=pd.DataFrame({'employee':['Julia','Marie','Adam','Nicole'],
                 'department':['Data Science','Web Development','Data Science','Cyber Security'],
                 'Year':['2005','2008','2011','2002']})
df2=pd.DataFrame({'employee':['Nicole','Adam','Julia','Marie'],
                 'country':['Canada','England','USA','Germany'],
                 'Salary':['22000','16000','20000','17500']})

In [24]:
df1

  employee       department  Year
0    Julia     Data Science  2005
1    Marie  Web Development  2008
2     Adam     Data Science  2011
3   Nicole   Cyber Security  2002

In [25]:
df2

  employee  country Salary
0   Nicole   Canada  22000
1     Adam  England  16000
2    Julia      USA  20000
3    Marie  Germany  17500

In [27]:
pd.concat([df1,df2])

  employee       department  Year  country Salary
0    Julia     Data Science  2005      NaN    NaN
1    Marie  Web Development  2008      NaN    NaN
2     Adam     Data Science  2011      NaN    NaN
3   Nicole   Cyber Security  2002      NaN    NaN
0   Nicole              NaN   NaN   Canada  22000
1     Adam              NaN   NaN  England  16000
2    Julia              NaN   NaN      USA  20000
3    Marie              NaN   NaN  Germany  17500

In [28]:
pd.concat([df1,df2],axis=1)

  employee       department  Year employee  country Salary
0    Julia     Data Science  2005   Nicole   Canada  22000
1    Marie  Web Development  2008     Adam  England  16000
2     Adam     Data Science  2011    Julia      USA  20000
3   Nicole   Cyber Security  2002    Marie  Germany  17500

In [31]:
# Merge() Function in Python 
# merge() parameters===>()dataframe1,other dataframes...,on,
# datframe1=>which dataframe to merge
# dataframes2=>which data frames to merge with datframe1
# on=>by which column you want to merge example on next cell
# how=>from which side the dataframe shoudl merged options are (left,right)
pd.merge(df1,df2)

  employee       department  Year  country Salary
0    Julia     Data Science  2005      USA  20000
1    Marie  Web Development  2008  Germany  17500
2     Adam     Data Science  2011  England  16000
3   Nicole   Cyber Security  2002   Canada  22000

In [32]:
pd.merge(df1,df2,on='employee')

  employee       department  Year  country Salary
0    Julia     Data Science  2005      USA  20000
1    Marie  Web Development  2008  Germany  17500
2     Adam     Data Science  2011  England  16000
3   Nicole   Cyber Security  2002   Canada  22000

In [33]:
pd.merge(df1,df2,on='employee',how="left")

  employee       department  Year  country Salary
0    Julia     Data Science  2005      USA  20000
1    Marie  Web Development  2008  Germany  17500
2     Adam     Data Science  2011  England  16000
3   Nicole   Cyber Security  2002   Canada  22000

In [34]:
pd.merge(df1,df2,on='employee',how="right")

  employee       department  Year  country Salary
0   Nicole   Cyber Security  2002   Canada  22000
1     Adam     Data Science  2011  England  16000
2    Julia     Data Science  2005      USA  20000
3    Marie  Web Development  2008  Germany  17500

In [35]:
# 3. Merge Pandas Dataframes Merge() Function Lesson 2
import numpy as np
import pandas as pd

In [37]:
df1=pd.DataFrame({'employee':['Julia','Marie','Adam','Nicole'],
                 'department':['Data Science','Web Development','Data Science','Cyber Security'],
                 'Year':['2005','2008','2011','2002']})
df2=pd.DataFrame({'employee':['Nicole','Adam','Julia','Marie'],
                 'country':['Canada','England','USA','Germany'],
                 'Salary':['22000','16000','20000','17500']})

In [38]:
df3=pd.DataFrame({'manager':['Abrahan','Jpseph','Kayra'],
                 'department':['Web Decvelopment','Cyber Security','Data Science']})

In [39]:
df3

   manager        department
0  Abrahan  Web Decvelopment
1   Jpseph    Cyber Security
2    Kayra      Data Science

In [42]:
df4=pd.merge(df1,df2)

In [44]:
df4

  employee       department  Year  country Salary
0    Julia     Data Science  2005      USA  20000
1    Marie  Web Development  2008  Germany  17500
2     Adam     Data Science  2011  England  16000
3   Nicole   Cyber Security  2002   Canada  22000

In [55]:
pd.merge(df4,df3,on='department',how='right')

  employee        department  Year  country Salary  manager
0      NaN  Web Decvelopment   NaN      NaN    NaN  Abrahan
1   Nicole    Cyber Security  2002   Canada  22000   Jpseph
2    Julia      Data Science  2005      USA  20000    Kayra
3     Adam      Data Science  2011  England  16000    Kayra

In [56]:
df5=pd.merge(df4,df3,on='department',how='right')

In [53]:
df6=pd.DataFrame({'department':['Web Development','Web Development','Cyber Security','Cyber Security',
                                'Data Science','Data Science'],
                 'prog_lang':['HTML','CSS','C++','SQL','PYTHON','R']})

In [54]:
df6

        department prog_lang
0  Web Development      HTML
1  Web Development       CSS
2   Cyber Security       C++
3   Cyber Security       SQL
4     Data Science    PYTHON
5     Data Science         R

In [57]:
pd.merge(df5,df6)

  employee      department  Year  country Salary manager prog_lang
0   Nicole  Cyber Security  2002   Canada  22000  Jpseph       C++
1   Nicole  Cyber Security  2002   Canada  22000  Jpseph       SQL
2    Julia    Data Science  2005      USA  20000   Kayra    PYTHON
3    Julia    Data Science  2005      USA  20000   Kayra         R
4     Adam    Data Science  2011  England  16000   Kayra    PYTHON
5     Adam    Data Science  2011  England  16000   Kayra         R

In [58]:
# 4. Merge Pandas Dataframes Merge() Function Lesson 3
import numpy as np
import pandas as pd

In [62]:
df1=pd.DataFrame({'employee':['Julia','Marie','Adam','Nicole'],
                 'department':['Data Science','Web Development','Data Science','Cyber Security'],
                 'Year':['2005','2008','2011','2002']})
df2=pd.DataFrame({'employee':['Nicole','Adam','Julia','Marie'],
                 'country':['Canada','England','USA','Germany'],
                 'Salary':['22000','16000','20000','17500']})

df3=pd.merge(df1,df2)
df3

  employee       department  Year  country Salary
0    Julia     Data Science  2005      USA  20000
1    Marie  Web Development  2008  Germany  17500
2     Adam     Data Science  2011  England  16000
3   Nicole   Cyber Security  2002   Canada  22000

In [63]:
df4=pd.DataFrame({'employee':['Julia','Alex','Adam','kayra'],
                 'department':['Data Science','Web Development','Data Science','Cyber Security'],
                 'university':['harvard','hamburg','oxford','metu']})

In [64]:
df4

  employee       department university
0    Julia     Data Science    harvard
1     Alex  Web Development    hamburg
2     Adam     Data Science     oxford
3    kayra   Cyber Security       metu

In [65]:
pd.merge(df3,df4,on=["employee","department"])

  employee    department  Year  country Salary university
0    Julia  Data Science  2005      USA  20000    harvard
1     Adam  Data Science  2011  England  16000     oxford

In [68]:
pd.merge(df3,df4,on=["employee","department"],how='outer')

  employee       department  Year  country Salary university
0    Julia     Data Science  2005      USA  20000    harvard
1    Marie  Web Development  2008  Germany  17500        NaN
2     Adam     Data Science  2011  England  16000     oxford
3   Nicole   Cyber Security  2002   Canada  22000        NaN
4     Alex  Web Development   NaN      NaN    NaN    hamburg
5    kayra   Cyber Security   NaN      NaN    NaN       metu

In [70]:
pd.merge(df3,df4,on=["employee","department"],how='left')

  employee       department  Year  country Salary university
0    Julia     Data Science  2005      USA  20000    harvard
1    Marie  Web Development  2008  Germany  17500        NaN
2     Adam     Data Science  2011  England  16000     oxford
3   Nicole   Cyber Security  2002   Canada  22000        NaN

In [71]:
# 5. Merge Pandas Dataframes Merge() Function Lesson 4\
import numpy as np
import pandas as pd

In [73]:
df1=pd.DataFrame({'employee':['Julia','Marie','Adam','Nicole'],
                 'department':['Data Science','Web Development','Data Science','Cyber Security'],
                 'Year':['2005','2008','2011','2002']})

df2=pd.DataFrame({'employee':['Nicole','Adam','Julia','Marie'],
                 'country':['Canada','England','USA','Germany'],
                 'Salary':['22000','16000','20000','17500']})

df3=pd.merge(df1,df2)
df3

  employee       department  Year  country Salary
0    Julia     Data Science  2005      USA  20000
1    Marie  Web Development  2008  Germany  17500
2     Adam     Data Science  2011  England  16000
3   Nicole   Cyber Security  2002   Canada  22000

In [86]:
df5=pd.DataFrame({'member':['George','Marie','Nicole',"Donald"],
                 'family_member':['4','5','1','3']})

In [87]:
df5

   member family_member
0  George             4
1   Marie             5
2  Nicole             1
3  Donald             3

In [91]:
pd.merge(df3,df5,left_on="employee",right_on="member")

  employee       department  Year  country Salary  member family_member
0    Marie  Web Development  2008  Germany  17500   Marie             5
1   Nicole   Cyber Security  2002   Canada  22000  Nicole             1

In [92]:
pd.merge(df3,df5,left_on="employee",right_on="member",how='outer')

  employee       department  Year  country Salary  member family_member
0    Julia     Data Science  2005      USA  20000     NaN           NaN
1    Marie  Web Development  2008  Germany  17500   Marie             5
2     Adam     Data Science  2011  England  16000     NaN           NaN
3   Nicole   Cyber Security  2002   Canada  22000  Nicole             1
4      NaN              NaN   NaN      NaN    NaN  George             4
5      NaN              NaN   NaN      NaN    NaN  Donald             3

In [93]:
pd.merge(df3,df5,left_on="employee",right_on="member",how='left')

  employee       department  Year  country Salary  member family_member
0    Julia     Data Science  2005      USA  20000     NaN           NaN
1    Marie  Web Development  2008  Germany  17500   Marie             5
2     Adam     Data Science  2011  England  16000     NaN           NaN
3   Nicole   Cyber Security  2002   Canada  22000  Nicole             1

In [94]:
pd.merge(df3,df5,left_on="employee",right_on="member",how='right')

  employee       department  Year  country Salary  member family_member
0      NaN              NaN   NaN      NaN    NaN  George             4
1    Marie  Web Development  2008  Germany  17500   Marie             5
2   Nicole   Cyber Security  2002   Canada  22000  Nicole             1
3      NaN              NaN   NaN      NaN    NaN  Donald             3

In [95]:
# 6. Joining Pandas Dataframes Join() Function
# join method joins two data frames together 
import numpy as np
import pandas as pd

In [108]:
df1=pd.DataFrame({'X':['X0','X1','X2'],
                 'Y':['Y0','Y1','Y2']},
                    index=['A0','A1','A2'])
df2=pd.DataFrame({'Z':['Z0','Z2','Z3'],
                 'T':['T0','T2','T3']},
                    index=['A0','A2','A3'])

In [109]:
df1

     X   Y
A0  X0  Y0
A1  X1  Y1
A2  X2  Y2

In [110]:
df2

     Z   T
A0  Z0  T0
A2  Z2  T2
A3  Z3  T3

In [113]:
df1.join(df2)

     X   Y    Z    T
A0  X0  Y0   Z0   T0
A1  X1  Y1  NaN  NaN
A2  X2  Y2   Z2   T2

In [114]:
df1.join(df2,how='inner')

     X   Y   Z   T
A0  X0  Y0  Z0  T0
A2  X2  Y2  Z2  T2

In [115]:
df1.join(df2,how='outer')

      X    Y    Z    T
A0   X0   Y0   Z0   T0
A1   X1   Y1  NaN  NaN
A2   X2   Y2   Z2   T2
A3  NaN  NaN   Z3   T3

In [116]:
df1.join(df2,how='right')

      X    Y   Z   T
A0   X0   Y0  Z0  T0
A2   X2   Y2  Z2  T2
A3  NaN  NaN  Z3  T3

In [118]:
df3=pd.DataFrame({'key':['X0','X2','X3','X4','X5','X6'],
                 'Y':['Y0','Y2','Y3','Y4','Y5','Y6']})


df4=pd.DataFrame({'key':['X0','X2','X3'],
                 'Z':['Z0','Z2','Z3']})

In [119]:
df3

  key   Y
0  X0  Y0
1  X2  Y2
2  X3  Y3
3  X4  Y4
4  X5  Y5
5  X6  Y6

In [120]:
df4

  key   Z
0  X0  Z0
1  X2  Z2
2  X3  Z3

In [126]:
df3.join(df4,lsuffix='left',rsuffix="right")

  keyleft   Y keyright    Z
0      X0  Y0       X0   Z0
1      X2  Y2       X2   Z2
2      X3  Y3       X3   Z3
3      X4  Y4      NaN  NaN
4      X5  Y5      NaN  NaN
5      X6  Y6      NaN  NaN

In [127]:
df3.join(df4,lsuffix='left',rsuffix="right",how='inner')

  keyleft   Y keyright   Z
0      X0  Y0       X0  Z0
1      X2  Y2       X2  Z2
2      X3  Y3       X3  Z3

In [128]:
df3.set_index("key")

      Y
key
X0   Y0
X2   Y2
X3   Y3
X4   Y4
X5   Y5
X6   Y6

In [129]:
df3.set_index("key").join(df4.set_index("key"))

      Y    Z
key
X0   Y0   Z0
X2   Y2   Z2
X3   Y3   Z3
X4   Y4  NaN
X5   Y5  NaN
X6   Y6  NaN